hdscmcu/hc32f120/DeviceDriverLibrary/hc32f120_ddl/driver/src/hc32f120_clk.c
/* parameter valid check for LRC state */
#define IS_VALID_CLK_LRC_STATE(STA)                                            \
(       ((STA) == CLK_LRC_OFF)                      ||                         \
        ((STA) == CLK_LRC_ON))

/* parameter valid check for XTAL32 state */
#define IS_VALID_CLK_XTAL32_STATE(STA)                                         \
(       ((STA) == CLK_XTAL32_OFF)                   ||                         \
        ((STA) == CLK_XTAL32_ON))

/* parameter valid check for XTAL32 super driver state */
#define IS_VALID_CLK_XTAL32_SUPDRV_STATE(STA)                                  \
(       ((STA) == CLK_XTAL32_SUPDRV_ON)             ||                         \
        ((STA) == CLK_XTAL32_SUPDRV_OFF))

/* parameter valid check for XTAL32 driver ability mode */
#define IS_VALID_CLK_XTAL32DRV_MODE(MODE)                                      \
(       ((MODE) == CLK_XTAL32DRV_MID)               ||                         \
        ((MODE) == CLK_XTAL32DRV_HIGH)              ||                         \
        ((MODE) == CLK_XTAL32DRV_LOW)               ||                         \
        ((MODE) == CLK_XTAL32DRV_ULOW))

/* parameter valid check for XTAL32 filtering selection */
#define IS_VALID_CLK_XTAL32_FILT_SEL(SEL)                                      \
(       ((SEL) == CLK_XTAL32NF_FULL)                ||                         \
        ((SEL) == CLK_XTAL32NF_PART)                ||                         \
        ((SEL) == CLK_XTAL32NF_NONE))

/* parameter valid check for HRC frequency selection */
#define IS_VALID_CLK_HRCFREQ_SEL(SEL)                                          \
(       ((SEL) == CLK_HRCFREQ_32)                   ||                         \
        ((SEL) == CLK_HRCFREQ_16)                   ||                         \
        ((SEL) == CLK_HRCFREQ_8)                    ||                         \
        ((SEL) == CLK_HRCFREQ_4)                    ||                         \
        ((SEL) == CLK_HRCFREQ_2)                    ||                         \
        ((SEL) == CLK_HRCFREQ_1)

/* parameter valid check for system clock source */
#define IS_VALID_CLK_SYSCLK_SRC(SRC)                                           \
(       ((SRC) == CLK_SYSCLKSOURCE_HRC)             ||                         \
        ((SRC) == CLK_SYSCLKSOURCE_XTAL)            ||                         \
        ((SRC) == CLK_SYSCLKSOURCE_LRC)             ||                         \
        ((SRC) == CLK_SYSCLKSOURCE_XTAL32))

/* parameter valid check for system clock divider */
#define IS_VALID_CLK_SYSCLK_DIV(DIV)                                           \
(       ((DIV) == CLK_SYSCLK_DIV1)                  ||                         \
        ((DIV) == CLK_SYSCLK_DIV2)                  ||                         \
        ((DIV) == CLK_SYSCLK_DIV4)                  ||                         \
        ((DIV) == CLK_SYSCLK_DIV8)                  ||                         \
        ((DIV) == CLK_SYSCLK_DIV16)                 ||                         \
        ((DIV) == CLK_SYSCLK_DIV32)                 ||                         \
        ((DIV) == CLK_SYSCLK_DIV64))

/* parameter valid check for hclk divider */
#define IS_VALID_HCLK_DIV(DIV)                                                 \
(       ((DIV) == CLK_HCLK_DIV1)                    ||                         \
        ((DIV) == CLK_HCLK_DIV2)                    ||                         \
        ((DIV) == CLK_HCLK_DIV4)                    ||                         \
        ((DIV) == CLK_HCLK_DIV8)                    ||                         \
        ((DIV) == CLK_HCLK_DIV16)                   ||                         \
        ((DIV) == CLK_HCLK_DIV32))

/* Parameter valid check for CLK MCO clock source. */
#define IS_VALID_CLK_MCOSOURCE(SOURCE)                                         \
(       ((SOURCE) == CLK_MCOSOURCCE_HRC)            ||                         \
        ((SOURCE) == CLK_MCOSOURCCE_LRC)            ||                         \
        ((SOURCE) == CLK_MCOSOURCCE_XTAL)           ||                         \
        ((SOURCE) == CLK_MCOSOURCCE_XTAL32)         ||                         \
        ((SOURCE) == CLK_MCOSOURCCE_SYSCLK))

/* Parameter valid check for CLK MCO clock Prescaler. */
#define IS_VALID_CLK_MCODIV(DIV)                                               \
(       ((DIV) == CLK_MCODIV_1)                     ||                         \
        ((DIV) == CLK_MCODIV_2)                     ||                         \
        ((DIV) == CLK_MCODIV_4)                     ||                         \
        ((DIV) == CLK_MCODIV_8)                     ||                         \
        ((DIV) == CLK_MCODIV_16)                    ||                         \
        ((DIV) == CLK_MCODIV_32)                    ||                         \
        ((DIV) == CLK_MCODIV_64)                    ||                         \
        ((DIV) == CLK_MCODIV_128))

/* Parameter valid check for CLK stable flag. */
#define IS_VALID_CLK_STB_FLAG(x)                                               \
(       ((x) == CLK_FLAG_HRCSTB)                 ||                            \
        ((x) == CLK_FLAG_XTALSTB)                ||                            \
        ((x) == CLK_FLAG_XTAL32STB))
/**
 * @}
 */

/**
 * @}
 */

/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/
/**
 * @defgroup CLK_Global_Functions CLK Global Functions
 * @{
 */
/**
  * @brief  Resets the CLK clock configuration to the default reset state.
  * @note   The default reset state of the clock configuration is given below:
  *            - LRC HRC ON and HRC used as system clock source
  *            - XTAL XTAL32 OFF
  *            - SysClk divider set to 1.
  *            - MCO OFF
  *            - All interrupts disabled
  * @param  None
  * @retval None
  */
void CLK_DeInit(void)
{
    /* Enable register write. */
    CLK_REG_WRITE_ENABLE();

