hdscmcu/hc32f120/DeviceDriverLibrary/hc32f120_ddl/driver/src/hc32f120_clk.c
    /* Reset peripheral clock */
    M0P_CMU->FCG = 0xFFFFFFFFu;

    /* Reset system clock / HCLK divider */
    M0P_CMU->SCKDIVR = 0x00u;
    M0P_CMU->PERICKSEL = 0x00u;

    /* Reset MCO */
    M0P_CMU->MCO1CFGR = 0x00u;

    /* Reset the system source */
    M0P_CMU->CKSWR = 0x00u;

    /* Reset HRC LRC XTAL XTAL32 */
    M0P_CMU->HRCCR = 0x00u;
    M0P_CMU->LRCCR = 0x00u;
    M0P_CMU->XTALCR = 0x01u;
    M0P_CMU->XTAL32CR = 0x01u;

    /* Reset XTALSTD */
    M0P_CMU->XTALSTDCR = 0x00u;

    /* Disbale register write. */
    CLK_REG_WRITE_DISABLE();
}

/**
 * @brief  Init Xtal initial structure with default value.
 * @param  pstcXtal specifies the parameter of XTAL.
 *            @arg    u8XtalState  : The new state of the XTAL.
 *            @arg    u8XtalMode   : The XTAL mode selection osc or exclk.
 *            @arg    u8XtalDrv    : The XTAL drive ability.
 *            @arg    u8XtalSupDrv : The XTAL super drive on or off.
 *            @arg    u8XtalStb    : The XTAL stable time selection.
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize success
 *           - ErrorInvalidParameter: Invalid parameter
 */
en_result_t CLK_XtalStrucInit(stc_clk_xtal_init_t* pstcXtal)
{
    en_result_t enRet = Ok;

    /* Check if pointer is NULL */
    if (NULL == pstcXtal)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Configure to default value */
        pstcXtal->u8XtalState   = CLK_XTAL_OFF;
        pstcXtal->u8XtalMode    = CLK_XTALMODE_OSC;
        pstcXtal->u8XtalDrv     = CLK_XTALDRV_HIGH;
        pstcXtal->u8XtalSupDrv  = CLK_XTAL_SUPDRV_ON;
        pstcXtal->u8XtalStb     = CLK_XTALSTB_8;
    }

    return enRet;
}

/**
  * @brief  Initialise the XTAL.
  * @param  pstcXtal specifies the parameter of XTAL.
  *            @arg    u8XtalState  : The new state of the XTAL.
  *            @arg    u8XtalMode   : The XTAL mode selection osc or exclk.
  *            @arg    u8XtalDrv    : The XTAL drive ability.
  *            @arg    u8XtalSupDrv : The XTAL super drive on or off.
  *            @arg    u8XtalStb    : The XTAL stable time selection.
  * @retval en_result_t Status
  */
en_result_t CLK_XTALInit(const stc_clk_xtal_init_t* pstcXtal)
{
    uint32_t u32timeout = 0ul;
    en_result_t enRet = Ok;

    if (pstcXtal == NULL)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* parameters check */
        DDL_ASSERT(IS_VALID_CLK_XTAL_STATE(pstcXtal->u8XtalState));

        /* Enable register write. */
        CLK_REG_WRITE_ENABLE();

        if(CLK_XTAL_OFF == pstcXtal->u8XtalState)
        {
            /* When the XTAL is used as system clock in these case XTAL will not disabled */
            if(CLK_SYSCLKSOURCE_XTAL == READ_REG8_BIT(M0P_CMU->CKSWR, CMU_CKSWR_CKSW))
            {
                enRet = Error;
            }
            else
            {
                /* Disable XTAL */
                M0P_CMU->XTALCR = CLK_XTAL_OFF;
                /* Wait XTAL stop */
                while(CLK_FLAG_XTALSTB == READ_REG8_BIT(M0P_CMU->OSCSTBSR, CMU_OSCSTBSR_XTALSTBF))
                {
                    u32timeout++;
                    if(u32timeout > CLK_XTAL_TIMEOUT)
                    {
                        enRet = ErrorTimeout;
                    }
                    else
                    {
                        /* code */
                    }
                }
            }
        }
        else
        {
            /* parameters check */
            DDL_ASSERT(IS_VALID_CLK_XTAL_MODE(pstcXtal->u8XtalMode));
            DDL_ASSERT(IS_VALID_CLK_XTALDRV_MODE(pstcXtal->u8XtalDrv));
            DDL_ASSERT(IS_VALID_CLK_XTAL_SUPDRV_STATE(pstcXtal->u8XtalSupDrv));
            DDL_ASSERT(IS_VALID_CLK_XTALSTB_SEL(pstcXtal->u8XtalStb));

            /* Configure XTAL mode, driver ability, super_driver */
            M0P_CMU->XTALCFGR = pstcXtal->u8XtalDrv | pstcXtal->u8XtalMode | pstcXtal->u8XtalSupDrv;
            /* Configure XTAL stable time */
            M0P_CMU->XTALSTBCR = pstcXtal->u8XtalStb;
            /* Enable XTAL */
            M0P_CMU->XTALCR = CLK_XTAL_ON;
            /* Wait XTAL stable */
            while(CLK_FLAG_XTALSTB != READ_REG8_BIT(M0P_CMU->OSCSTBSR, CMU_OSCSTBSR_XTALSTBF))
            {
                u32timeout++;
                if(u32timeout > CLK_XTAL_TIMEOUT)
                {
                    enRet = ErrorTimeout;
                }
                else
                {
                    /* code */
                }
            }
        }

        /* Disbale register write. */
        CLK_REG_WRITE_DISABLE();
    }

    return enRet;
}

/**
 * @brief  Init Xtal32 initial structure with default value.
 * @param  pstcXtal32 specifies the parameter of XTAL32.
 *            @arg    u8Xtal32State  : The new state of the XTAL32.
 *            @arg    u8Xtal32Drv    : The XTAL mode selection osc or exclk.
 *            @arg    u8Xtal32SupDrv: The XTAL drive ability.
 *            @arg    u8Xtal32NF     : The XTAL super drive on or off.
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize success
 *           - ErrorInvalidParameter: Invalid parameter
 */
en_result_t CLK_Xtal32StrucInit(stc_clk_xtal32_init_t* pstcXtal32)
{
    en_result_t enRet = Ok;

    /* Check if pointer is NULL */
    if (NULL == pstcXtal32)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Configure to default value */
        pstcXtal32->u8Xtal32State   = CLK_XTAL32_OFF;
        pstcXtal32->u8Xtal32Drv     = CLK_XTAL32DRV_MID;
        pstcXtal32->u8Xtal32SupDrv  = CLK_XTAL32_SUPDRV_OFF;
        pstcXtal32->u8Xtal32NF      = CLK_XTAL32NF_FULL;
    }

    return enRet;
}

/**
 * @brief  Initialise the XTAL32.
 * @param  pstcXtal32 specifies the parameter of XTAL32.
 *            @arg    u8Xtal32State  : The new state of the XTAL32.
 *            @arg    u8Xtal32Drv    : The XTAL mode selection osc or exclk.
 *            @arg    u8Xtal32SupDrv: The XTAL drive ability.
 *            @arg    u8Xtal32NF     : The XTAL super drive on or off.
 * @retval en_result_t Status
 */
en_result_t CLK_XTAL32Init(const stc_clk_xtal32_init_t* pstcXtal32)
{
    uint32_t u32timeout = 0ul;
    en_result_t enRet = Ok;

    if (pstcXtal32 == NULL)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* parameters check */
        DDL_ASSERT(IS_VALID_CLK_XTAL32_STATE(pstcXtal32->u8Xtal32State));

        /* Enable register write. */
        CLK_REG_WRITE_ENABLE();

        if(CLK_XTAL32_OFF == pstcXtal32->u8Xtal32State)
        {
            /* When the XTAL32 is used as system clock in these case XTAL32 will not disabled */
            if(CLK_SYSCLKSOURCE_XTAL32 == READ_REG8_BIT(M0P_CMU->CKSWR, CMU_CKSWR_CKSW))
            {
                enRet = Error;
            }
            else
            {
                /* Disable XTAL32 */
                M0P_CMU->XTAL32CR = CLK_XTAL32_OFF;
                /* Wait XTAL32 stop */
                while(CLK_FLAG_XTAL32STB == READ_REG8_BIT(M0P_CMU->OSCSTBSR, CMU_OSCSTBSR_XTAL32STBF))
                {
                    u32timeout++;
                    if(u32timeout > CLK_TIMEOUT)
                    {
                        enRet = ErrorTimeout;
                    }
                    else
                    {
                        /* code */
                    }
                }
            }
        }
        else
        {
            /* parameters check */
            DDL_ASSERT(IS_VALID_CLK_XTAL32DRV_MODE(pstcXtal32->u8Xtal32Drv));
            DDL_ASSERT(IS_VALID_CLK_XTAL32_SUPDRV_STATE(pstcXtal32->u8Xtal32SupDrv));
            DDL_ASSERT(IS_VALID_CLK_XTAL32_FILT_SEL(pstcXtal32->u8Xtal32NF));

