hdscmcu/hc32f120/DeviceDriverLibrary/hc32f120_ddl/driver/src/hc32f120_clk.c
            /* Configure the XTAL32 driver ability and super_driver */
            M0P_CMU->XTAL32CFGR = pstcXtal32->u8Xtal32Drv | pstcXtal32->u8Xtal32SupDrv;
            /* Configure the XTAL32 filtering */
            M0P_CMU->XTAL32NFR = pstcXtal32->u8Xtal32NF;
            /* Enable XTAL32 */
            M0P_CMU->XTAL32CR = CLK_XTAL32_ON;
            /* Wait XTAL32 stable */
            while(CLK_FLAG_XTAL32STB != READ_REG8_BIT(M0P_CMU->OSCSTBSR, CMU_OSCSTBSR_XTAL32STBF))
            {
                u32timeout++;
                if(u32timeout > CLK_TIMEOUT)
                {
                    enRet = ErrorTimeout;
                }
                else
                {
                    /* code */
                }
            }
        }

        /* Disbale register write. */
        CLK_REG_WRITE_DISABLE();
    }

    return enRet;
}

/**
 * @brief  Initialise the HRC.
 * @param  HRCState specifies the new state of HRC.
 *           This parameter can be one of the following values:
 *            @arg    CLK_HRC_OFF  : Disable HRC.
 *            @arg    CLK_HRC_ON   : Enable HRC.
 * @param  HRCFreq  specifies the frequency of HRC.
 *           This parameter can be one of the following values:
 *            @arg    CLK_HRCFREQ_32 : HRC frequency is 32MHz while ICG.HRCFREQS[3] = 0.
 *            @arg    CLK_HRCFREQ_16 : HRC frequency is 16MHz while ICG.HRCFREQS[3] = 0.
 *            @arg    CLK_HRCFREQ_8  : HRC frequency is 8MHz while ICG.HRCFREQS[3] = 0.
 *            @arg    CLK_HRCFREQ_4  : HRC frequency is 4MHz while ICG.HRCFREQS[3] = 0.
 *            @arg    CLK_HRCFREQ_2  : HRC frequency is 2MHz while ICG.HRCFREQS[3] = 0.
 *            @arg    CLK_HRCFREQ_1  : HRC frequency is 1MHz while ICG.HRCFREQS[3] = 0.
 *            @arg    CLK_HRCFREQ_48 : HRC frequency is 48MHz while ICG.HRCFREQS[3] = 1.
 *            @arg    CLK_HRCFREQ_24 : HRC frequency is 24MHz while ICG.HRCFREQS[3] = 1.
 *            @arg    CLK_HRCFREQ_12 : HRC frequency is 12MHz while ICG.HRCFREQS[3] = 1.
 *            @arg    CLK_HRCFREQ_6  : HRC frequency is 6MHz while ICG.HRCFREQS[3] = 1.
 *            @arg    CLK_HRCFREQ_3  : HRC frequency is 3MHz while ICG.HRCFREQS[3] = 1.
 *            @arg    CLK_HRCFREQ_1P5: HRC frequency is 1.5MHz while ICG.HRCFREQS[3] = 1.
 * @retval en_result_t Status
 */
en_result_t CLK_HRCInit(uint8_t HRCState, uint8_t HRCFreq)
{
    uint32_t u32timeout = 0ul;
    en_result_t enRet = Ok;

    /* parameters check */
    DDL_ASSERT(IS_VALID_CLK_HRC_STATE(HRCState));

    /* Enable register write. */
    CLK_REG_WRITE_ENABLE();

    if(CLK_HRC_OFF == HRCState)
    {
        /* When the HRC is used as system clock in these case HRC will not disabled */
        if(CLK_SYSCLKSOURCE_HRC == READ_REG8_BIT(M0P_CMU->CKSWR, CMU_CKSWR_CKSW))
        {
            enRet = Error;
        }
        else
        {
            /* Disable HRC */
            M0P_CMU->HRCCR = CLK_HRC_OFF;
            /* Wait HRC stop */
            while(CLK_FLAG_HRCSTB == READ_REG8_BIT(M0P_CMU->OSCSTBSR, CMU_OSCSTBSR_HRCSTBF))
            {
                u32timeout++;
                if(u32timeout > CLK_TIMEOUT)
                {
                    enRet = ErrorTimeout;
                }
                else
                {
                    /* code */
                }
            }
        }
    }
    else
    {
        /* parameters check */
        DDL_ASSERT(IS_VALID_CLK_HRC_FREQ_SEL(HRCFreq));

        /* Enable CMU_HRCCFGR register write */
        CLK_HRCCFGR_WRITE_ENBALE();

        /* Configure HRC frequency */
        M0P_EFM->HRCCFGR = HRCFreq;

        /* Disbale CMU_HRCCFGR register write */
        CLK_HRCCFGR_WRITE_DISABLE();

        /* Enable HRC */
        M0P_CMU->HRCCR = CLK_HRC_ON;
        /* Wait HRC stable */
        while(CLK_FLAG_HRCSTB != READ_REG8_BIT(M0P_CMU->OSCSTBSR, CMU_OSCSTBSR_HRCSTBF))
        {
            u32timeout++;
            if(u32timeout > CLK_TIMEOUT)
            {
                enRet = ErrorTimeout;
            }
            else
            {
                /* code */
            }
        }
    }

    /* Disbale register write. */
    CLK_REG_WRITE_DISABLE();

    /* Update system clock */
    SystemCoreClockUpdate();

    return enRet;
}

/**
 * @brief  Initialise the LRC.
 * @param  LRCState specifies the new state of LRC.
 *           This parameter can be one of the following values:
 *            @arg    CLK_LRC_OFF  : Disable LRC.
 *            @arg    CLK_LRC_ON   : Enable LRC.
 * @retval en_result_t Status
 */
en_result_t CLK_LRCInit(uint8_t LRCState)
{
    en_result_t enRet = Ok;
    /* parameters check */
    DDL_ASSERT(IS_VALID_CLK_LRC_STATE(LRCState));

    /* Enable register write. */
    CLK_REG_WRITE_ENABLE();

    if(CLK_LRC_OFF == LRCState)
    {
        /* When the LRC is used as system clock in these case LRC will not disabled */
        if(CLK_SYSCLKSOURCE_LRC == READ_REG8_BIT(M0P_CMU->CKSWR, CMU_CKSWR_CKSW))
        {
            enRet = Error;
        }
        else
        {
            /* Disable LRC */
            M0P_CMU->LRCCR = CLK_LRC_OFF;
        }
    }
    else
    {
        /* Enable LRC */
        M0P_CMU->LRCCR = CLK_LRC_ON;
    }

    /* Disbale register write. */
    CLK_REG_WRITE_DISABLE();

    return enRet;
}

/**
 * @brief  Init XtalStd initial structure with default value.
 * @param  pstcXtalStd specifies the parameter of XTALSTD.
 *            @arg    u8XtalStdState:   The new state of the XTALSTD.
 *            @arg    u8XtalStdMode:    The XTAL status detection occur interrupt or reset.
 *            @arg    u8XtalStdInt:     The XTAL status detection interrupt on or off.
 *            @arg    u8XtalStdRst:     The XTAL status detection reset on or off.
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize success
 *           - ErrorInvalidParameter: Invalid parameter
 */
en_result_t CLK_XtalStdStrucInit(stc_clk_xtalstd_init_t* pstcXtalStd)
{
    en_result_t enRet = Ok;

    /* Check if pointer is NULL */
    if (NULL == pstcXtalStd)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Configure to default value */
        pstcXtalStd->u8XtalStdState = CLK_XTALSTD_OFF;
        pstcXtalStd->u8XtalStdMode  = CLK_XTALSTD_MODE_INT;
        pstcXtalStd->u8XtalStdInt   = CLK_XTALSTD_RST_OFF;
        pstcXtalStd->u8XtalStdRst   = CLK_XTALSTD_INT_OFF;
    }

    return enRet;
}

/**
 * @brief  Initialise the XTAL status detection.
 * @param  pstcXtalStd specifies the parameter of XTALSTD.
 *            @arg    u8XtalStdState:   The new state of the XTALSTD.
 *            @arg    u8XtalStdMode:    The XTAL status detection occur interrupt or reset.
 *            @arg    u8XtalStdInt:     The XTAL status detection interrupt on or off.
 *            @arg    u8XtalStdRst:     The XTAL status detection reset on or off.
 * @retval None
 */
en_result_t CLK_XTALStdInit(const stc_clk_xtalstd_init_t* pstcXtalStd)
{
    en_result_t enRet = Ok;

    if (pstcXtalStd == NULL)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* parameter valid check */
        DDL_ASSERT(IS_VALID_CLK_XTALSTD_STATE(pstcXtalStd->u8XtalStdState));

        /* Enable register write. */
        CLK_REG_WRITE_ENABLE();

        if(CLK_XTALSTD_OFF == pstcXtalStd->u8XtalStdState)
        {
            /* Disbale XTAL status detection */
            bM0P_CMU->XTALSTDCR_b.XTALSTDE = (uint32_t)CLK_XTALSTD_OFF;
        }
        else
        {
            /* parameter valid check */
            DDL_ASSERT(IS_VALID_CLK_XTALSTD_MODE(pstcXtalStd->u8XtalStdMode));
            DDL_ASSERT(IS_VALID_CLK_XTALSTD_INT_STATE(pstcXtalStd->u8XtalStdInt));
            DDL_ASSERT(IS_VALID_CLK_XTALSTD_RST_STATE(pstcXtalStd->u8XtalStdRst));

