hdscmcu/hc32f120/DeviceDriverLibrary/hc32f120_ddl/driver/src/hc32f120_clk.c
            /* Confiure XTALSTD and enable XTALSTD */
            M0P_CMU->XTALSTDCR = pstcXtalStd->u8XtalStdState | pstcXtalStd->u8XtalStdMode | \
                                pstcXtalStd->u8XtalStdInt   | pstcXtalStd->u8XtalStdRst;
        }
        /* Disbale register write. */
        CLK_REG_WRITE_DISABLE();
    }

    return enRet;
}

/**
 * @brief  Set the system clock source.
 * @param  u8Src specifies the source of system clock.
 *          This parameter can be one of the following values:
 *            @arg    CLK_SYSCLKSOURCE_HRC    : select HRC as system clock source
 *            @arg    CLK_SYSCLKSOURCE_XTAL   : select XTAL as system clock source
 *            @arg    CLK_SYSCLKSOURCE_LRC    : select LRC as system clock source
 *            @arg    CLK_SYSCLKSOURCE_XTAL32 : select XTAL32 as system clock source
 * @retval None
 */
void CLK_SetSysclkSrc(uint8_t u8Src)
{
    DDL_ASSERT(IS_VALID_CLK_SYSCLK_SRC(u8Src));

    /* Enable register write. */
    CLK_REG_WRITE_ENABLE();

    /* Set system clock source */
    M0P_CMU->CKSWR = u8Src;

    /* Disbale register write. */
    CLK_REG_WRITE_DISABLE();

    /* Update system clock */
    SystemCoreClockUpdate();
}

/**
 * @brief  Set the system clock divider.
 * @param  u8Div specifies the divider of system clock.
 *          This parameter can be one of the following values:
 *            @arg    CLK_SYSCLK_DIV1 : system clock 1 divider
 *            @arg    CLK_SYSCLK_DIV2 : system clock 2 divider
 *            @arg    CLK_SYSCLK_DIV4 : system clock 4 divider
 *            @arg    CLK_SYSCLK_DIV8 : system clock 8 divider
 *            @arg    CLK_SYSCLK_DIV16: system clock 16 divider
 *            @arg    CLK_SYSCLK_DIV32: system clock 32 divider
 * @retval None
 */
void CLK_SetSysclkDiv(uint8_t u8Div)
{
    DDL_ASSERT(IS_VALID_CLK_SYSCLK_DIV(u8Div));

    /* Enable register write. */
    CLK_REG_WRITE_ENABLE();

    /* Set system clock divider */
    M0P_CMU->SCKDIVR = u8Div;

    /* Disbale register write. */
    CLK_REG_WRITE_DISABLE();

    /* Update system clock */
    SystemCoreClockUpdate();
}

/**
 * @brief  Set the HCLK divider witch used as ADC clock.
 * @param  u8Div specifies the divider of HCLK.
 *          This parameter can be one of the following values:
 *            @arg    CLK_HCLK_DIV1 : HCLK 1 divider
 *            @arg    CLK_HCLK_DIV2 : HCLK 2 divider
 *            @arg    CLK_HCLK_DIV4 : HCLK 4 divider
 *            @arg    CLK_HCLK_DIV8 : HCLK 8 divider
 *            @arg    CLK_HCLK_DIV16: HCLK 16 divider
 *            @arg    CLK_HCLK_DIV32: HCLK 32 divider
 * @retval None
 */
void CLK_SetADClkDiv(uint8_t u8Div)
{
    DDL_ASSERT(IS_VALID_HCLK_DIV(u8Div));

    /* Enable register write. */
    CLK_REG_WRITE_ENABLE();

    /* Set ADC clock divider */
    M0P_CMU->PERICKSEL = u8Div;

    /* Disbale register write. */
    CLK_REG_WRITE_DISABLE();
}

/**
 * @brief  Enable or disable the FCG peripheral clock.
 * @note   After reset,the peripheral clock is disabled and the application
 *         software has to enable this clock before using it.
 * @param  u32FcgPeriph specifies the peripheral in FCG.
 *          This parameter can be one of the following values:
 *            @arg CLK_FCG_ADC:      ADC clock
 *            @arg CLK_FCG_CTC:      CTC clock
 *            @arg CLK_FCG_AOS:      AOS clock
 *            @arg CLK_FCG_CRC:      CRC clock
 *            @arg CLK_FCG_TIMB1:    TIMB1 clock
 *            @arg CLK_FCG_TIMB2:    TIMB2 clock
 *            @arg CLK_FCG_TIMB3:    TIMB3 clock
 *            @arg CLK_FCG_TIMB4:    TIMB4 clock
 *            @arg CLK_FCG_TIMB5:    TIMB5 clock
 *            @arg CLK_FCG_TIMB6:    TIMB6 clock
 *            @arg CLK_FCG_TIMB7:    TIMB7 clock
 *            @arg CLK_FCG_TIMB8:    TIMB8 clock
 *            @arg CLK_FCG_TIM0:     TIM0 clock
 *            @arg CLK_FCG_RTC:      RTC clock
 *            @arg CLK_FCG_UART1:    UART1 clock
 *            @arg CLK_FCG_UART2:    UART2 clock
 *            @arg CLK_FCG_UART3:    UART3 clock
 *            @arg CLK_FCG_UART4:    UART4 clock
 *            @arg CLK_FCG_I2C:      I2C clock
 *            @arg CLK_FCG_SPI:      SPI clock
 *
 * @param  enNewState specifies the new state of the clock output.
 *          This parameter can be one of the following values:
 *            @arg Enable:   Enable clock output.
 *            @arg Disable:  Disable clock output.
 * @retval None
 */
void CLK_FcgPeriphClockCmd(uint32_t u32FcgPeriph, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    /* Enable register write. */
    CLK_REG_WRITE_ENABLE();

    if(Enable == enNewState)
    {
        M0P_CMU->FCG &= ~u32FcgPeriph;
    }
    else
    {
        M0P_CMU->FCG |= u32FcgPeriph;
    }

    /* Disbale register write. */
    CLK_REG_WRITE_DISABLE();
}

/**
 * @brief  Selects the clock source to output on MCO pin(P15).
 * @note   P15 should be configured in alternate function mode.
 * @param  CLK_MCOSource specifies the clock source to output.
 *          This parameter can be one of the following values:
 *            @arg CLK_MCOSOURCCE_HRC:       HRC clock selected as MCOx source
 *            @arg CLK_MCOSOURCCE_LRC:       LRC clock selected as MCOx source
 *            @arg CLK_MCOSOURCCE_XTAL:      XTAL clock selected as MCOx source
 *            @arg CLK_MCOSOURCCE_XTAL32:    XTAL32 clock selected as MCOx source
 *            @arg CLK_MCOSOURCCE_SYSCLK:    System clock(SYSCLK) selected as MCOx source
 * @param  CLK_MCODiv specifies the MCOx prescaler.
 *          This parameter can be one of the following values:
 *            @arg CLK_MCODIV_1:   no division applied to MCOx clock
 *            @arg CLK_MCODIV_2:   division by 2 applied to MCOx clock
 *            @arg CLK_MCODIV_4:   division by 4 applied to MCOx clock
 *            @arg CLK_MCODIV_8:   division by 8 applied to MCOx clock
 *            @arg CLK_MCODIV_16:  division by 16 applied to MCOx clock
 *            @arg CLK_MCODIV_32:  division by 32 applied to MCOx clock
 *            @arg CLK_MCODIV_64:  division by 64 applied to MCOx clock
 *            @arg CLK_MCODIV_128: division by 128 applied to MCOx clock
 * @retval None
 */
void CLK_MCOConfig(uint8_t CLK_MCOSource, uint8_t CLK_MCODiv)
{
    /* Check the parameters. */
    DDL_ASSERT(IS_VALID_CLK_MCOSOURCE(CLK_MCOSource));
    DDL_ASSERT(IS_VALID_CLK_MCODIV(CLK_MCODiv));

    /* Enable register write. */
    CLK_REG_WRITE_ENABLE();

    /* Configure the MCO and Enable MCO */
    M0P_CMU->MCO1CFGR = (CMU_MCO1CFGR_MCO1EN | CLK_MCODiv | CLK_MCOSource);

    /* Disbale register write. */
    CLK_REG_WRITE_DISABLE();
}

/**
 * @brief  Enable or disable the MCO.
 * @param  enNewState specifies the new state of the clock output.
 *          This parameter can be one of the following values:
 *            @arg Enable:   Enable clock output.
 *            @arg Disable:  Disable clock output.
 * @retval None
 */
void CLK_MCOCmd(en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    /* Enable register write. */
    CLK_REG_WRITE_ENABLE();

    /* Enable or disable clock output. */
    bM0P_CMU->MCO1CFGR_b.MCO1EN = enNewState;

    /* Disbale register write. */
    CLK_REG_WRITE_DISABLE();
}

/**
 * @brief  Clear the XTAL error flag.
 * @param  None
 * @retval None
 * @note   The system clock should not be XTAL before call this function.
 */
void CLK_ClearXtalStdFlag(void)
{
    /* Enable register write. */
    CLK_REG_WRITE_ENABLE();

    if(CMU_XTALSTDSR_XTALSTDF == M0P_CMU->XTALSTDSR)
    {
        /* Clear the XTAL STD flag */
        CLEAR_REG8_BIT(M0P_CMU->XTALSTDSR, CMU_XTALSTDSR_XTALSTDF);
    }

    /* Disbale register write. */
    CLK_REG_WRITE_DISABLE();
}

/**
 * @brief  Get the clock stable flag.
 * @param  u8Flag  specifies the clock stable flag.
 *          This parameter can be one of the following values:
 *            @arg CLK_FLAG_HRCSTB:       HRC clock stable flag
 *            @arg CLK_FLAG_XTALSTB:      XTAL clock stable flag
 *            @arg CLK_FLAG_XTAL32STB:    XTAL32 clock stable flag
 * @retval en_flag_status_t
 */
en_flag_status_t CLK_GetStableFlag(uint8_t u8Flag)
{
    en_flag_status_t enFlagStatus = Reset;

    /* Check parameters */
    DDL_ASSERT(IS_VALID_CLK_STB_FLAG(u8Flag));

    if (Reset != (READ_REG8_BIT(M0P_CMU->OSCSTBSR, u8Flag)))
    {
        enFlagStatus = Set;
    }

    return enFlagStatus;
}

/**
 * @}
 */

#endif /* DDL_CLK_ENABLE */

/**
 * @}
 */

/**
* @}
*/

/******************************************************************************
 * EOF (not truncated)
 *****************************************************************************/
